#### terraform plan every: 799b5c1
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.vpc_endpoint.aws_vpc_endpoint.cloudwatch_logs: Refreshing state... [id=vpce-06444baf92e997cab]
module.vpc_endpoint.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-05431006590a1b472]
module.iam.aws_iam_role_policy.mysql_db_password_policy_secretsmanager: Refreshing state... [id=EcsTaskRole-discord-instagram-bot:password-policy-mysql_db_password_policy_secretsmanager]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:cluster/discord-instagram-bot]
module.vpc_endpoint.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-0ccaa1f440cb79d95]
module.vpc_endpoint.aws_vpc_endpoint.ssm: Refreshing state... [id=vpce-039f196f5a8310b96]
module.vpc_endpoint.aws_security_group.vpc_endpoint: Refreshing state... [id=sg-071578ecb33144c17]
module.vpc_endpoint.aws_vpc_endpoint_route_table_association.private_s3[1]: Refreshing state... [id=a-vpce-000cb8297f6b967da2984063053]
module.vpc_endpoint.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-000cb8297f6b967da]
module.cloudwatch.aws_cloudwatch_log_group.main: Refreshing state... [id=/aws/ecs/discord-instagram-bot]
module.ssm.aws_ssm_parameter.database_password_secret: Refreshing state... [id=MYSQL_PASSWORD]
module.vpc_endpoint.aws_vpc_endpoint_route_table_association.private_s3[0]: Refreshing state... [id=a-vpce-000cb8297f6b967da3633538435]
module.vpc_endpoint.aws_vpc_endpoint_route_table_association.private_s3[2]: Refreshing state... [id=a-vpce-000cb8297f6b967da3111060547]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0219c5015d0627f06]
module.ecr.aws_ecr_repository.main: Refreshing state... [id=discord-instagram-bot]
module.iam.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=EcsTaskRole-discord-instagram-bot]
module.iam.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_for_ecr: Refreshing state... [id=EcsTaskRole-discord-instagram-bot-20210515144659286700000001]
module.ecs.aws_ecs_task_definition.main: Refreshing state... [id=discord-instagram-bot-task-definition]
module.iam.aws_iam_role_policy.cloudwatch_logs: Refreshing state... [id=EcsTaskRole-discord-instagram-bot:cloudwatch_logs]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0e45a090904c9ab1d]
module.vpc.aws_subnet.privates[0]: Refreshing state... [id=subnet-0fb948f228d9d112f]
module.security.aws_security_group.ecs: Refreshing state... [id=sg-086c267e1e2207c43]
module.vpc.aws_subnet.privates[2]: Refreshing state... [id=subnet-0aed969abfb5a6b8a]
module.vpc.aws_subnet.privates[1]: Refreshing state... [id=subnet-007456b5f4d45d89f]
module.security.aws_security_group.alb: Refreshing state... [id=sg-0da582b80a2919b39]
module.alb.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/discord-instagram-bot/02ca0d7fb837c41b]
module.vpc.aws_route_table.privates[0]: Refreshing state... [id=rtb-09dfe003f37f6fa01]
module.vpc.aws_subnet.publics[0]: Refreshing state... [id=subnet-0b3f607aa8028d7d7]
module.vpc.aws_subnet.publics[1]: Refreshing state... [id=subnet-011f1a6e62c871778]
module.vpc.aws_subnet.publics[2]: Refreshing state... [id=subnet-0811d6780fa40db10]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-07adf71781ae87ed1]
module.vpc.aws_route_table.privates[1]: Refreshing state... [id=rtb-0b972285c43ef8586]
module.vpc.aws_route_table.privates[2]: Refreshing state... [id=rtb-0292c7a41f76eb5cf]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-0e45a090904c9ab1d1080289494]
module.vpc.aws_route_table_association.privates[1]: Refreshing state... [id=rtbassoc-0730f79efc3000e03]
module.vpc.aws_route_table_association.privates[2]: Refreshing state... [id=rtbassoc-0bab84d600257f8aa]
module.vpc.aws_route_table_association.privates[0]: Refreshing state... [id=rtbassoc-06e92ec6691013325]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b0ccfb579951dc58]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-086f9e70679e407a4]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a11d6b569f35e936]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/discord-instagram-bot/cfe435b04aca145d]
module.ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:service/discord-instagram-bot/discord-instagram-bot]
module.alb.aws_lb_listener.http_to_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/discord-instagram-bot/cfe435b04aca145d/48c95e81d12bd930]
module.route53.aws_route53_record.main: Refreshing state... [id=Z04052072YGY8CIREK2A2_discord-instagram-bot.moikilo00.net_A]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/discord-instagram-bot/cfe435b04aca145d/ddede1b7ced80e00]
module.alb.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener-rule/app/discord-instagram-bot/cfe435b04aca145d/ddede1b7ced80e00/5a533f1f53ff6be0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.data.template_file.container_definitions will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "container_definitions"  {
      ~ id       = "95cbde5307ce2178930d659e7a948f3c76460e3daf3940c77be0898b8e7ebc4d" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - image        = "nginx:latest"
                  - name         = "nginx"
                  - portMappings = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ vars     = {
          + "aws_ssm_parameter_consumer_key_arn"    = (known after apply)
          + "aws_ssm_parameter_consumer_secret_arn" = (known after apply)
          + "aws_ssm_parameter_mid_arn"             = (known after apply)
          + "aws_ssm_parameter_sessionid_arn"       = (known after apply)
          + "aws_ssm_parameter_token_arn"           = (known after apply)
          ~ "container_name"                        = "nginx" -> "discord-instagram-bot"
          ~ "container_tag"                         = "1.0.0-160b84e" -> "1.0.0-f85d7be"
          - "database_password"                     = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/MYSQL_PASSWORD" -> null
          - "db_port"                               = "3306" -> null
          - "mysql_database"                        = "discord" -> null
          - "mysql_user"                            = "user" -> null
            # (2 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_ecs_service.main must be replaced
-/+ resource "aws_ecs_service" "main" {
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ap-northeast-1:554506578892:service/discord-instagram-bot/discord-instagram-bot" -> (known after apply)
        name                               = "discord-instagram-bot"
      ~ platform_version                   = "LATEST" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:554506578892:task-definition/discord-instagram-bot-task-definition:1" -> (known after apply)
        # (9 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      + load_balancer { # forces replacement
          + container_name   = "discord-instagram-bot"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/discord-instagram-bot/02ca0d7fb837c41b"
        }
      - load_balancer { # forces replacement
          - container_name   = "nginx" -> null
          - container_port   = 80 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/discord-instagram-bot/02ca0d7fb837c41b" -> null
        }

      ~ network_configuration {
          ~ subnets          = [
              - "subnet-007456b5f4d45d89f",
              + "subnet-011f1a6e62c871778",
              + "subnet-0811d6780fa40db10",
              - "subnet-0aed969abfb5a6b8a",
              + "subnet-0b3f607aa8028d7d7",
              - "subnet-0fb948f228d9d112f",
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # module.ecs.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:554506578892:task-definition/discord-instagram-bot-task-definition:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu          = 0
                  - environment  = []
                  - essential    = true
                  - image        = "nginx:latest"
                  - mountPoints  = []
                  - name         = "nginx"
                  - portMappings = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom  = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "discord-instagram-bot-task-definition" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.iam.aws_iam_role_policy.ecs_to_ssm[0] will be created
  + resource "aws_iam_role_policy" "ecs_to_ssm" {
      + id     = (known after apply)
      + name   = "ecs_to_ssm"
      + policy = (known after apply)
      + role   = "EcsTaskRole-discord-instagram-bot"
    }

  # module.iam.aws_iam_role_policy.ecs_to_ssm[1] will be created
  + resource "aws_iam_role_policy" "ecs_to_ssm" {
      + id     = (known after apply)
      + name   = "ecs_to_ssm"
      + policy = (known after apply)
      + role   = "EcsTaskRole-discord-instagram-bot"
    }

  # module.iam.aws_iam_role_policy.ecs_to_ssm[2] will be created
  + resource "aws_iam_role_policy" "ecs_to_ssm" {
      + id     = (known after apply)
      + name   = "ecs_to_ssm"
      + policy = (known after apply)
      + role   = "EcsTaskRole-discord-instagram-bot"
    }

  # module.iam.aws_iam_role_policy.ecs_to_ssm[3] will be created
  + resource "aws_iam_role_policy" "ecs_to_ssm" {
      + id     = (known after apply)
      + name   = "ecs_to_ssm"
      + policy = (known after apply)
      + role   = "EcsTaskRole-discord-instagram-bot"
    }

  # module.iam.aws_iam_role_policy.ecs_to_ssm[4] will be created
  + resource "aws_iam_role_policy" "ecs_to_ssm" {
      + id     = (known after apply)
      + name   = "ecs_to_ssm"
      + policy = (known after apply)
      + role   = "EcsTaskRole-discord-instagram-bot"
    }

  # module.iam.aws_iam_role_policy.mysql_db_password_policy_secretsmanager will be destroyed
  - resource "aws_iam_role_policy" "mysql_db_password_policy_secretsmanager" {
      - id     = "EcsTaskRole-discord-instagram-bot:password-policy-mysql_db_password_policy_secretsmanager" -> null
      - name   = "password-policy-mysql_db_password_policy_secretsmanager" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ap-northeast-1:554506578892:parameter/MYSQL_PASSWORD",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "EcsTaskRole-discord-instagram-bot" -> null
    }

  # module.ssm.aws_ssm_parameter.consumer_key will be created
  + resource "aws_ssm_parameter" "consumer_key" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "consumer_key"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "String"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.ssm.aws_ssm_parameter.consumer_secret will be created
  + resource "aws_ssm_parameter" "consumer_secret" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "consumer_secret"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "String"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.ssm.aws_ssm_parameter.database_password_secret will be destroyed
  - resource "aws_ssm_parameter" "database_password_secret" {
      - arn       = "arn:aws:ssm:ap-northeast-1:554506578892:parameter/MYSQL_PASSWORD" -> null
      - data_type = "text" -> null
      - id        = "MYSQL_PASSWORD" -> null
      - name      = "MYSQL_PASSWORD" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value)
      - version   = 1 -> null
    }

  # module.ssm.aws_ssm_parameter.mid will be created
  + resource "aws_ssm_parameter" "mid" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "mid"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "String"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.ssm.aws_ssm_parameter.sessionid will be created
  + resource "aws_ssm_parameter" "sessionid" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "sessionid"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "String"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.ssm.aws_ssm_parameter.token will be created
  + resource "aws_ssm_parameter" "token" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "token"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "String"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.vpc_endpoint.aws_security_group.vpc_endpoint will be destroyed
  - resource "aws_security_group" "vpc_endpoint" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:554506578892:security-group/sg-071578ecb33144c17" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - id                     = "sg-071578ecb33144c17" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "vpc_endpoint_sg" -> null
      - owner_id               = "554506578892" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0219c5015d0627f06" -> null
    }

  # module.vpc_endpoint.aws_vpc_endpoint.cloudwatch_logs will be destroyed
  - resource "aws_vpc_endpoint" "cloudwatch_logs" {
      - arn                   = "arn:aws:ec2:ap-northeast-1:554506578892:vpc-endpoint/vpce-06444baf92e997cab" -> null
      - cidr_blocks           = [] -> null
      - dns_entry             = [
          - {
              - dns_name       = "vpce-06444baf92e997cab-2i552vnm.logs.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "vpce-06444baf92e997cab-2i552vnm-ap-northeast-1a.logs.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "vpce-06444baf92e997cab-2i552vnm-ap-northeast-1d.logs.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "vpce-06444baf92e997cab-2i552vnm-ap-northeast-1c.logs.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "logs.ap-northeast-1.amazonaws.com"
              - hosted_zone_id = "Z0634993JR39SNE0IHOF"
            },
        ] -> null
      - id                    = "vpce-06444baf92e997cab" -> null
      - network_interface_ids = [
          - "eni-00c83d62f318d9e06",
          - "eni-026452b4ba55b0221",
          - "eni-0918d23eedbb4699f",
        ] -> null
      - owner_id              = "554506578892" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
            }
        ) -> null
      - private_dns_enabled   = true -> null
      - requester_managed     = false -> null
      - route_table_ids       = [] -> null
      - security_group_ids    = [
          - "sg-071578ecb33144c17",
        ] -> null
      - service_name          = "com.amazonaws.ap-northeast-1.logs" -> null
      - state                 = "available" -> null
      - subnet_ids            = [
          - "subnet-007456b5f4d45d89f",
          - "subnet-0aed969abfb5a6b8a",
          - "subnet-0fb948f228d9d112f",
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - vpc_endpoint_type     = "Interface" -> null
      - vpc_id                = "vpc-0219c5015d0627f06" -> null
    }

  # module.vpc_endpoint.aws_vpc_endpoint.ecr_api will be destroyed
  - resource "aws_vpc_endpoint" "ecr_api" {
      - arn                   = "arn:aws:ec2:ap-northeast-1:554506578892:vpc-endpoint/vpce-05431006590a1b472" -> null
      - cidr_blocks           = [] -> null
      - dns_entry             = [
          - {
              - dns_name       = "vpce-05431006590a1b472-lb44kayw.api.ecr.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "vpce-05431006590a1b472-lb44kayw-ap-northeast-1a.api.ecr.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "vpce-05431006590a1b472-lb44kayw-ap-northeast-1c.api.ecr.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "vpce-05431006590a1b472-lb44kayw-ap-northeast-1d.api.ecr.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "api.ecr.ap-northeast-1.amazonaws.com"
              - hosted_zone_id = "Z0635298O9PMJVN5AO2U"
            },
        ] -> null
      - id                    = "vpce-05431006590a1b472" -> null
      - network_interface_ids = [
          - "eni-01832e18e7df0315c",
          - "eni-0b0907beec83e0c82",
          - "eni-0b881508c28745bb5",
        ] -> null
      - owner_id              = "554506578892" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
            }
        ) -> null
      - private_dns_enabled   = true -> null
      - requester_managed     = false -> null
      - route_table_ids       = [] -> null
      - security_group_ids    = [
          - "sg-071578ecb33144c17",
        ] -> null
      - service_name          = "com.amazonaws.ap-northeast-1.ecr.api" -> null
      - state                 = "available" -> null
      - subnet_ids            = [
          - "subnet-007456b5f4d45d89f",
          - "subnet-0aed969abfb5a6b8a",
          - "subnet-0fb948f228d9d112f",
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - vpc_endpoint_type     = "Interface" -> null
      - vpc_id                = "vpc-0219c5015d0627f06" -> null
    }

  # module.vpc_endpoint.aws_vpc_endpoint.ecr_dkr will be destroyed
  - resource "aws_vpc_endpoint" "ecr_dkr" {
      - arn                   = "arn:aws:ec2:ap-northeast-1:554506578892:vpc-endpoint/vpce-0ccaa1f440cb79d95" -> null
      - cidr_blocks           = [] -> null
      - dns_entry             = [
          - {
              - dns_name       = "vpce-0ccaa1f440cb79d95-usqo3d9i.dkr.ecr.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "vpce-0ccaa1f440cb79d95-usqo3d9i-ap-northeast-1a.dkr.ecr.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "vpce-0ccaa1f440cb79d95-usqo3d9i-ap-northeast-1d.dkr.ecr.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "vpce-0ccaa1f440cb79d95-usqo3d9i-ap-northeast-1c.dkr.ecr.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "dkr.ecr.ap-northeast-1.amazonaws.com"
              - hosted_zone_id = "Z0635323285TJKLR5GIMJ"
            },
          - {
              - dns_name       = "*.dkr.ecr.ap-northeast-1.amazonaws.com"
              - hosted_zone_id = "Z0635323285TJKLR5GIMJ"
            },
        ] -> null
      - id                    = "vpce-0ccaa1f440cb79d95" -> null
      - network_interface_ids = [
          - "eni-0c4b9e8e2a5485763",
          - "eni-0d5a40cede97f7af1",
          - "eni-0db3a127dfd10da1d",
        ] -> null
      - owner_id              = "554506578892" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
            }
        ) -> null
      - private_dns_enabled   = true -> null
      - requester_managed     = false -> null
      - route_table_ids       = [] -> null
      - security_group_ids    = [
          - "sg-071578ecb33144c17",
        ] -> null
      - service_name          = "com.amazonaws.ap-northeast-1.ecr.dkr" -> null
      - state                 = "available" -> null
      - subnet_ids            = [
          - "subnet-007456b5f4d45d89f",
          - "subnet-0aed969abfb5a6b8a",
          - "subnet-0fb948f228d9d112f",
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - vpc_endpoint_type     = "Interface" -> null
      - vpc_id                = "vpc-0219c5015d0627f06" -> null
    }

  # module.vpc_endpoint.aws_vpc_endpoint.s3 will be destroyed
  - resource "aws_vpc_endpoint" "s3" {
      - arn                   = "arn:aws:ec2:ap-northeast-1:554506578892:vpc-endpoint/vpce-000cb8297f6b967da" -> null
      - cidr_blocks           = [
          - "3.5.152.0/21",
          - "52.219.0.0/20",
          - "52.219.152.0/22",
          - "52.219.136.0/22",
          - "52.219.16.0/22",
          - "52.219.68.0/22",
        ] -> null
      - dns_entry             = [] -> null
      - id                    = "vpce-000cb8297f6b967da" -> null
      - network_interface_ids = [] -> null
      - owner_id              = "554506578892" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - prefix_list_id        = "pl-61a54008" -> null
      - private_dns_enabled   = false -> null
      - requester_managed     = false -> null
      - route_table_ids       = [
          - "rtb-0292c7a41f76eb5cf",
          - "rtb-09dfe003f37f6fa01",
          - "rtb-0b972285c43ef8586",
        ] -> null
      - security_group_ids    = [] -> null
      - service_name          = "com.amazonaws.ap-northeast-1.s3" -> null
      - state                 = "available" -> null
      - subnet_ids            = [] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - vpc_endpoint_type     = "Gateway" -> null
      - vpc_id                = "vpc-0219c5015d0627f06" -> null
    }

  # module.vpc_endpoint.aws_vpc_endpoint.ssm will be destroyed
  - resource "aws_vpc_endpoint" "ssm" {
      - arn                   = "arn:aws:ec2:ap-northeast-1:554506578892:vpc-endpoint/vpce-039f196f5a8310b96" -> null
      - cidr_blocks           = [] -> null
      - dns_entry             = [
          - {
              - dns_name       = "vpce-039f196f5a8310b96-uqu6a309.ssm.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "vpce-039f196f5a8310b96-uqu6a309-ap-northeast-1a.ssm.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "vpce-039f196f5a8310b96-uqu6a309-ap-northeast-1c.ssm.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "vpce-039f196f5a8310b96-uqu6a309-ap-northeast-1d.ssm.ap-northeast-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2E726K9Y6RL4W"
            },
          - {
              - dns_name       = "ssm.ap-northeast-1.amazonaws.com"
              - hosted_zone_id = "Z06259363DTUQ8AGC272X"
            },
        ] -> null
      - id                    = "vpce-039f196f5a8310b96" -> null
      - network_interface_ids = [
          - "eni-03d36ae445812d1df",
          - "eni-0aa54584e7e57c070",
          - "eni-0e4928eb8f77f29fe",
        ] -> null
      - owner_id              = "554506578892" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
            }
        ) -> null
      - private_dns_enabled   = true -> null
      - requester_managed     = false -> null
      - route_table_ids       = [] -> null
      - security_group_ids    = [
          - "sg-071578ecb33144c17",
        ] -> null
      - service_name          = "com.amazonaws.ap-northeast-1.ssm" -> null
      - state                 = "available" -> null
      - subnet_ids            = [
          - "subnet-007456b5f4d45d89f",
          - "subnet-0aed969abfb5a6b8a",
          - "subnet-0fb948f228d9d112f",
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - vpc_endpoint_type     = "Interface" -> null
      - vpc_id                = "vpc-0219c5015d0627f06" -> null
    }

  # module.vpc_endpoint.aws_vpc_endpoint_route_table_association.private_s3[0] will be destroyed
  - resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      - id              = "a-vpce-000cb8297f6b967da3633538435" -> null
      - route_table_id  = "rtb-09dfe003f37f6fa01" -> null
      - vpc_endpoint_id = "vpce-000cb8297f6b967da" -> null
    }

  # module.vpc_endpoint.aws_vpc_endpoint_route_table_association.private_s3[1] will be destroyed
  - resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      - id              = "a-vpce-000cb8297f6b967da2984063053" -> null
      - route_table_id  = "rtb-0b972285c43ef8586" -> null
      - vpc_endpoint_id = "vpce-000cb8297f6b967da" -> null
    }

  # module.vpc_endpoint.aws_vpc_endpoint_route_table_association.private_s3[2] will be destroyed
  - resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      - id              = "a-vpce-000cb8297f6b967da3111060547" -> null
      - route_table_id  = "rtb-0292c7a41f76eb5cf" -> null
      - vpc_endpoint_id = "vpce-000cb8297f6b967da" -> null
    }

Plan: 12 to add, 0 to change, 13 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

<details><summary>Show Plan Error</summary>

```terraform

```

</details>


*Pusher: @lazmond3, Action: `pull_request`*